app/controllers/bugs_controller.rb

SELECT "bugs".* FROM "bugs"
---
  def index
    @bugs = Bug.all

INSERT INTO "bugs" ("title", "author", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test1"], ["author", "test1"], ["body", "test1"], ["created_at", "2018-02-27 16:04:33.199180"], ["updated_at", "2018-02-27 16:04:33.199180"]]
---
  def create
    @bug = Bug.new(bug_params)

    respond_to do |format|
      if @bug.save

UPDATE "bugs" SET "author" = ?, "body" = ?, "priority" = ?, "state" = ?, "updated_at" = ? WHERE "bugs"."id" = ?  [["author", "Drew"], ["body", "Bug from console"], ["priority", 2], ["state", "closed"], ["updated_at", "2018-03-06 13:32:32.189142"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @bug.update(bug_params)

SELECT  "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_bug
      @bug = Bug.find(params[:id])